14. Performance Testing- Exercise JMeter/Report/statistics.json
{
  "https://blazedemo.com/" : {
    "transaction" : "https://blazedemo.com/",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1315.6,
    "medianResTime" : 1043.0,
    "minResTime" : 833.0,
    "maxResTime" : 2518.0,
    "pct1ResTime" : 2518.0,
    "pct2ResTime" : 2518.0,
    "pct3ResTime" : 2518.0,
    "throughput" : 1.6165535079211122,
    "receivedKBytesPerSec" : 7.509711950371807,
    "sentKBytesPerSec" : 1.1871564823795668
  },
  "https://blazedemo.com/purchase.php" : {
    "transaction" : "https://blazedemo.com/purchase.php",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 867.4,
    "medianResTime" : 367.0,
    "minResTime" : 335.0,
    "maxResTime" : 1699.0,
    "pct1ResTime" : 1699.0,
    "pct2ResTime" : 1699.0,
    "pct3ResTime" : 1699.0,
    "throughput" : 1.3444474321054047,
    "receivedKBytesPerSec" : 8.81637158846464,
    "sentKBytesPerSec" : 0.8586607623016941
  },
  "Test" : {
    "transaction" : "Test",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4450.2,
    "medianResTime" : 3746.0,
    "minResTime" : 2114.0,
    "maxResTime" : 8428.0,
    "pct1ResTime" : 8428.0,
    "pct2ResTime" : 8428.0,
    "pct3ResTime" : 8428.0,
    "throughput" : 0.5820044232336166,
    "receivedKBytesPerSec" : 13.986862159527414,
    "sentKBytesPerSec" : 1.5988070728087536
  },
  "https://blazedemo.com/confirmation.php" : {
    "transaction" : "https://blazedemo.com/confirmation.php",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1455.6,
    "medianResTime" : 451.0,
    "minResTime" : 362.0,
    "maxResTime" : 5430.0,
    "pct1ResTime" : 5430.0,
    "pct2ResTime" : 5430.0,
    "pct3ResTime" : 5430.0,
    "throughput" : 0.7367025195226168,
    "receivedKBytesPerSec" : 4.158340393399145,
    "sentKBytesPerSec" : 0.5712322270517165
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1112.5500000000002,
    "medianResTime" : 742.5,
    "minResTime" : 262.0,
    "maxResTime" : 5430.0,
    "pct1ResTime" : 2436.1000000000017,
    "pct2ResTime" : 5284.399999999998,
    "pct3ResTime" : 5430.0,
    "throughput" : 2.136752136752137,
    "receivedKBytesPerSec" : 12.837727864583334,
    "sentKBytesPerSec" : 1.4674520900106838
  },
  "https://blazedemo.com/reserve.php" : {
    "transaction" : "https://blazedemo.com/reserve.php",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 811.6,
    "medianResTime" : 553.0,
    "minResTime" : 262.0,
    "maxResTime" : 1623.0,
    "pct1ResTime" : 1623.0,
    "pct2ResTime" : 1623.0,
    "pct3ResTime" : 1623.0,
    "throughput" : 2.073828287017835,
    "receivedKBytesPerSec" : 14.899565144131065,
    "sentKBytesPerSec" : 1.2414616600995438
  }
}