14. Performance Testing- Exercise JMeter/Report50Users/statistics.json
{
  "https://blazedemo.com/" : {
    "transaction" : "https://blazedemo.com/",
    "sampleCount" : 750,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1034.0120000000027,
    "medianResTime" : 428.0,
    "minResTime" : 242.0,
    "maxResTime" : 7026.0,
    "pct1ResTime" : 2820.6999999999994,
    "pct2ResTime" : 4035.1999999999907,
    "pct3ResTime" : 5367.380000000001,
    "throughput" : 6.827740655098957,
    "receivedKBytesPerSec" : 31.71832255498607,
    "sentKBytesPerSec" : 5.014122043588296
  },
  "https://blazedemo.com/purchase.php" : {
    "transaction" : "https://blazedemo.com/purchase.php",
    "sampleCount" : 750,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1020.8960000000002,
    "medianResTime" : 440.0,
    "minResTime" : 252.0,
    "maxResTime" : 7389.0,
    "pct1ResTime" : 2784.899999999999,
    "pct2ResTime" : 3951.049999999998,
    "pct3ResTime" : 5332.92,
    "throughput" : 6.8491899691329845,
    "receivedKBytesPerSec" : 44.91436586203905,
    "sentKBytesPerSec" : 4.374384999817355
  },
  "Test" : {
    "transaction" : "Test",
    "sampleCount" : 750,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4060.5426666666667,
    "medianResTime" : 3317.5,
    "minResTime" : 1071.0,
    "maxResTime" : 15170.0,
    "pct1ResTime" : 7278.4,
    "pct2ResTime" : 8518.649999999989,
    "pct3ResTime" : 12060.370000000003,
    "throughput" : 6.595493958527534,
    "receivedKBytesPerSec" : 158.50443945446472,
    "sentKBytesPerSec" : 18.118285649744095
  },
  "https://blazedemo.com/confirmation.php" : {
    "transaction" : "https://blazedemo.com/confirmation.php",
    "sampleCount" : 750,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1016.5173333333323,
    "medianResTime" : 423.0,
    "minResTime" : 241.0,
    "maxResTime" : 7136.0,
    "pct1ResTime" : 2938.8,
    "pct2ResTime" : 4046.0499999999993,
    "pct3ResTime" : 5576.84,
    "throughput" : 6.752620016566428,
    "receivedKBytesPerSec" : 38.11540987278064,
    "sentKBytesPerSec" : 5.235918255032953
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1015.1356666666672,
    "medianResTime" : 432.0,
    "minResTime" : 241.0,
    "maxResTime" : 7915.0,
    "pct1ResTime" : 2799.9,
    "pct2ResTime" : 3933.95,
    "pct3ResTime" : 5331.969999999999,
    "throughput" : 26.211403708039914,
    "receivedKBytesPerSec" : 157.47963223762386,
    "sentKBytesPerSec" : 18.001142243827214
  },
  "https://blazedemo.com/reserve.php" : {
    "transaction" : "https://blazedemo.com/reserve.php",
    "sampleCount" : 750,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 989.1173333333322,
    "medianResTime" : 432.0,
    "minResTime" : 241.0,
    "maxResTime" : 7915.0,
    "pct1ResTime" : 2668.2999999999993,
    "pct2ResTime" : 3659.6499999999974,
    "pct3ResTime" : 5258.1900000000005,
    "throughput" : 6.868760875538054,
    "receivedKBytesPerSec" : 49.349095470052205,
    "sentKBytesPerSec" : 4.111865641313307
  }
}